import React from "react"
import { createUnit } from '../Functions'

import InariHuntsman from '../../../../images/monsters/inari/InariHuntsman.png'
import InariHuntsmanIcon from '../../../../images/monsters/inari/icon/InariHuntsmanIcon.png'
import InariShortbowAssassin from '../../../../images/monsters/inari/InariShortbowAssassin.png'
import InariShortbowAssassinIcon from '../../../../images/monsters/inari/icon/InariShortbowAssassinIcon.png'
import InariSmith from '../../../../images/monsters/inari/InariSmith.png'
import InariSmithIcon from '../../../../images/monsters/inari/icon/InariSmithIcon.png'
import InariSpearHunter from '../../../../images/monsters/inari/InariSpearHunter.png'
import InariSpearHunterIcon from '../../../../images/monsters/inari/icon/InariSpearHunterIcon.png'
import InariTimberWolf from '../../../../images/monsters/inari/InariTimberWolf.png'
import InariTimberWolfIcon from '../../../../images/monsters/inari/icon/InariTimberWolfIcon.png'
import InariFalcon from '../../../../images/monsters/inari/InariFalcon.png'
import InariFalconIcon from '../../../../images/monsters/inari/icon/InariFalconIcon.png'
import InariArcherCavalry from '../../../../images/monsters/inari/InariArcherCavalry.png'
import InariArcherCavalryIcon from '../../../../images/monsters/inari/icon/InariArcherCavalryIcon.png'
import InariJavelinCavalry from '../../../../images/monsters/inari/InariJavelinCavalry.png'
import InariJavelinCavalryIcon from '../../../../images/monsters/inari/icon/InariJavelinCavalryIcon.png'
import InariLightCavalry from '../../../../images/monsters/inari/InariLightCavalry.png'
import InariLightCavalryIcon from '../../../../images/monsters/inari/icon/InariLightCavalryIcon.png'
import InariForestSage from '../../../../images/monsters/inari/InariForestSage.png'
import InariForestSageIcon from '../../../../images/monsters/inari/icon/InariForestSageIcon.png'
import InariNatureWizard from '../../../../images/monsters/inari/InariNatureWizard.png'
import InariNatureWizardIcon from '../../../../images/monsters/inari/icon/InariNatureWizardIcon.png'
import InariStormPriest from '../../../../images/monsters/inari/InariStormPriest.png'
import InariStormPriestIcon from '../../../../images/monsters/inari/icon/InariStormPriestIcon.png'

const InariUnits = {
    InariHuntsman:
        createUnit(
            '稻荷猎人', 750, 0, 3, 0,
            50, 100, 30, [['近战武器', 1, 1, '物理']],
            4, 390, 0, 0, 1,
            [0, 85, 0], [0, 1, 0], 2, 2,
            ['林间集市/森林聚居地/绿荫要塞'],
            {
                '资源采集者': '稻荷猎人可以花费一整个回合采集食纤和魔晶资源，采集速度分别为：10食纤/每回合、4魔晶（普通矿）/每回合，10魔晶（高纯矿）/每回合。',
                '快速采集': '稻荷猎人采集资源时，若距离任意资源收集建筑不大于6格，则可以直接将采集到的资源传送回资源收集建筑。',
                '战争武装（需要拥有林间集市/森林聚居地/绿荫要塞）': '稻荷猎人可以在任意位置消耗60食纤、15魔晶、2回合时间，升级成短弓刺客。',
                '快速改装（需要在森林聚居地或绿荫要塞中升级）': '稻荷猎人能够瞬间完成战争武装，不再需要额外的回合数。',
            },
            '',
            [InariHuntsman, InariHuntsmanIcon],
        ),
    InariSmith:
        createUnit(
            '稻荷工匠', 900, 0, 3, 0,
            50, 100, 30, [['近战武器', 1, 1, '物理']],
            4, 390, 0, 0, 1,
            [0, 60, 0], [0, 1, 0], 2, 2,
            ['林间集市/森林聚居地/绿荫要塞'],
            {
                '资源采集者': '稻荷工匠可以花费一整个回合采集木材资源，采集速度为：2木材/每回合。',
                '快速采集': '稻荷工匠采集资源时，若距离任意资源收集建筑不大于6格，则可以直接将采集到的资源传送回资源收集建筑。',
                '稻荷建造者': '稻荷工匠可以建造伊纳利三足联盟阵营的建筑。同一时间，一个伊纳利三足联盟阵营的建筑只允许一个稻荷工匠在其地基周围1格推进建设。',
                '建筑修补': '稻荷工匠可以消耗一个动作宣言，维修临近自身的非生命建筑单位最多30点健康值，该稻荷工匠的控制者将支付对应的维修资源消耗。',
                '战争武装（需要拥有林间集市/森林聚居地/绿荫要塞）': '稻荷工匠可以在任意位置消耗60食纤、2回合时间，升级成猎狮矛手。',
                '快速改装（需要在森林聚居地或绿荫要塞中升级）': '稻荷工匠能够瞬间完成战争武装，不再需要额外的回合数。',
            },
            '',
            [InariSmith, InariSmithIcon],
        ),
    InariShortbowAssassin:
        createUnit(
            '短弓刺客', 750, 0, 1, 0,
            100, 100, 70, [['远程箭矢', 2, 4, '物理'], ['近战武器', 1, 1, '80%物理']],
            5, 530, 10, 10, 1,
            [0, 130, 15], [0, 1, 0], 2, 2,
            [],
            {
                '升级而来的单位': '短弓刺客通常无法直接被训练，而是应该通过其他单位升级得到。',
                '精简训练（需要在绿荫要塞中升级）': '短弓刺客可以从资源收集建筑、兽灵之园、游猎营地、翠石高塔里被直接训练。',
                '卸甲归田（需要拥有林间集市/森林聚居地/绿荫要塞）': '短弓刺客可以在任意位置消耗2回合时间，降级成稻荷猎人，若降级位置与资源收集建筑相邻，则降级完成后返还40食纤、15魔晶。',
                '快速改装（需要在森林聚居地或绿荫要塞中升级）': '短弓刺客能够瞬间完成卸甲归田，不再需要额外的回合数。',
                '回收网（需要在森林聚居地或绿荫要塞中升级）': '短弓刺客的卸甲归田返还资源不再需要与资源收集建筑相邻，而是在其周围10格或以内即可。',
                '骑乘训练（需要在森林聚居地或绿荫要塞中升级）': '短弓刺客可以骑乘林狼和猎鹰。如果短弓刺客骑乘的是迅捷弓骑兵/浸毒标枪骑兵/骁勇轻骑兵，短弓刺客的攻击力与防御力上升10点。',
                '反射扳机（需要在林间集市/森林聚居地/绿荫要塞中升级）': '短弓刺客的远程箭矢攻击最小射程降低1格（变为1格），当短弓刺客以1格射程进行远程箭矢攻击时，造成的伤害提升20%。',
                '隐伏战术（需要在森灵石碑中升级）': '短弓刺客在没有进行和遭受任何宣言两回合后，在第三个回合开始阶段会进入【潜行】状态。',
                '伺机而动（需要在森灵石碑中升级）': '若【潜行】状态下的短弓刺客的移动宣言只移动了1格，则【潜行】状态不会失效。',
            },
            '',
            [InariShortbowAssassin, InariShortbowAssassinIcon],
        ),
    InariSpearHunter:
        createUnit(
            '猎狮矛手', 900, 0, 1, 0,
            100, 100, 80, [['近战武器', 1, 1, '物理']],
            6, 560, 10, 10, 1,
            [0, 105, 0], [0, 1, 0], 2, 2,
            [],
            {
                '升级而来的单位': '猎狮矛手通常无法直接被训练，而是应该通过其他单位升级得到。',
                '精简训练（需要在绿荫要塞中升级）': '猎狮矛手可以从资源收集建筑、兽灵之园、游猎营地、翠石高塔里被直接训练。',
                '卸甲归田（需要拥有林间集市/森林聚居地/绿荫要塞）': '猎狮矛手可以在任意位置消耗2回合时间，降级成稻荷工匠，若降级位置与资源收集建筑相邻，则降级完成后返还40食纤、15魔晶。',
                '快速改装（需要在森林聚居地或绿荫要塞中升级）': '猎狮矛手能够瞬间完成卸甲归田，不再需要额外的回合数。',
                '回收网（需要在森林聚居地或绿荫要塞中升级）': '猎狮矛手的卸甲归田返还资源不再需要与资源收集建筑相邻，而是在其周围10格或以内即可。',
                '骑乘训练（需要在森林聚居地或绿荫要塞中升级）': '猎狮矛手可以骑乘林狼和猎鹰。如果猎狮矛手骑乘的是迅捷弓骑兵/浸毒标枪骑兵/骁勇轻骑兵，猎狮矛手的攻击力与防御力上升10点。',
                '加长猎矛（需要在林间集市/森林聚居地/绿荫要塞中升级）': '猎狮矛手的近战武器攻击最大射程增加1格（变为2格）。',
                '隐伏战术（需要在森灵石碑中升级）': '猎狮矛手在没有进行和遭受任何宣言两回合后，在第三个回合开始阶段会进入【潜行】状态。',
                '伺机而动（需要在森灵石碑中升级）': '若【潜行】状态下的猎狮矛手的移动宣言只移动了1格，则【潜行】状态不会失效。',
            },
            '',
            [InariSpearHunter, InariSpearHunterIcon],
        ),
    InariTimberWolf:
        createUnit(
            '林狼', 1200, 0, 5, 0,
            100, 90, 95, [['近战武器', 1, 1, '物理']],
            11, 1110, 15, 15, 1,
            [0, 140, 0], [0, 1, 0], 2, 2,
            [],
            {
                '直觉':'响应式技能，当林狼周围8格内存在不属于自己部族的【潜行】单位时，林狼立刻发出嚎叫，嚎叫声会被部族管理者和距离林狼不超过15格的所有其他部族单位的管理者知晓。'+
                '技能响应后立刻进入冷却，冷却时间为6回合。',
                '骑乘训练（需要在森林聚居地或绿荫要塞中升级）': '林狼可以为一个短弓刺客或猎狮矛手单位提供骑术对象。',
                '充足营养（需要升级）': '林狼的健康值上限增加150点。',
            },
            '',
            [InariTimberWolf, InariTimberWolfIcon],
        ),
    InariFalcon:
        createUnit(
            '猎鹰', 700, 0, 0, 0,
            100, 100, 60, [['近身格斗（对空）', 1, 1, '物理']],
            13, 990, 20, 0, 1,
            [0, 145, 0], [0, 1, 0], 2, 3,
            [],
            {
                '永久飞行单位': '猎鹰是飞行单位，且无法自主落地（除非被骑乘的一瞬间）。',
                '鹰眼': '猎鹰的视野不受夜晚影响。',
                '快速痊愈': '猎鹰在没有进行和遭受任何战斗宣言两回合后，于第三个回合开始，每回合结束阶段回复100健康值。',
                '骑乘训练（需要在森林聚居地或绿荫要塞中升级）': '猎鹰可以为一个短弓刺客或猎狮矛手单位提供骑术对象。',
                '充足营养（需要升级）': '猎鹰的健康值上限增加150点。',
            },
            '',
            [InariFalcon, InariFalconIcon],
        ),
    InariArcherCavalry:
        createUnit(
            '迅捷弓骑兵', 1500, 0, 5, 0,
            100, 100, 200, [['远程箭矢', 2, 7, '物理']],
            12, 1025, 15, 15, 4,
            [0, 250, 175], [0, 3, 0], 9, 5,
            ['游猎营地'],
            {
                '搭载': '迅捷弓骑兵可以作为被骑乘的目标，为体型0~1的一个单位提供骑术对象。',
                '移动射击': '迅捷弓骑兵可以在进行移动宣言时的某个路径点上发动攻击宣言。目标受到伤害时，视为迅捷弓骑兵已抵达移动终点。',
                '硬质弓弦（需要在游猎营地中升级）': '迅捷弓骑兵的最大射程增加3格（共10格）。',
                '灵巧身姿（需要在游猎营地中升级）': '迅捷弓骑兵无视区域封锁。',
                '游击战术（需要在绿荫要塞中升级）': '迅捷弓骑兵处于被骑乘状态时，移动力增加2格、先攻值增加225点。',
            },
            '',
            [InariArcherCavalry, InariArcherCavalryIcon],
        ),
    InariJavelinCavalry:
        createUnit(
            '浸毒标枪骑兵', 1650, 0, 5, 0,
            100, 100, 120, [['近战武器', 1, 2, '物理'], ['远程投掷（需要在游猎营地中升级）', 3, 7, '物理']],
            10, 965, 15, 10, 4,
            [0, 280, 160], [0, 3, 0], 8, 5,
            ['游猎营地'],
            {
                '搭载': '浸毒标枪骑兵可以作为被骑乘的目标，为体型0~1的一个单位提供骑术对象。',
                '浸毒标枪': '浸毒标枪骑兵对目标造成伤害时，会令目标刷新3回合【稻荷毒粉】状态（同种状态取持续回合更长者）。处于【稻荷毒粉】状态下的目标，每回合结束阶段流失2.5%当前健康值。',
                '毒粉陷阱': '浸毒标枪骑兵消耗一个动作宣言，可以于相邻1格处设置【潜行】状态的毒粉陷阱。陷阱不被激活的情况下会一直存在，有任何目标接触陷阱或陷阱受到任何伤害后将会立刻激活。' +
                    '陷阱激活后，立即对距离陷阱不超过3格的覆盖区域内的目标附加一个持续6回合的【稻荷毒粉】状态（同种状态取持续回合更长者）。' +
                    '处于【稻荷毒粉】状态下的目标，每回合结束阶段流失2.5%当前健康值。浸毒标枪骑兵训练完毕时，自带2个毒粉陷阱且无法自我补充。',
                '不稳定花粉（需要在游猎营地中升级）': '浸毒标枪骑兵的毒粉陷阱激活时，影响范围增加2格。',
                '制作标枪（需要在游猎营地中升级）': '浸毒标枪骑兵在没有标枪时，可以消耗20木材和一个动作宣言，制作一杆新的标枪。浸毒标枪骑兵最多只能持有一杆标枪。',
                '游击战术（需要在绿荫要塞中升级）': '浸毒标枪骑兵处于被骑乘状态时，移动力增加2格、先攻值增加225点。',
            },
            '',
            [InariJavelinCavalry, InariJavelinCavalryIcon],
        ),
    InariLightCavalry:
        createUnit(
            '骁勇轻骑兵', 1800, 0, 7, 0,
            110, 110, 220, [['近战武器', 1, 2, '物理']],
            12, 1030, 15, 15, 4,
            [0, 245, 180], [0, 3, 0], 8, 5,
            ['游猎营地', '游骑兵林场'],
            {
                '搭载': '骁勇轻骑兵可以作为被骑乘的目标，为体型0~1的一个单位提供骑术对象。',
                '骁勇善战': '骁勇轻骑兵无视区域封锁和背击。',
                '奔腾飞跃（需要在游骑兵林场中升级）': '骁勇轻骑兵移动时，可以花费150%移动力（向上取整）飞跃不长于4格的沟壑地形或攀登不高于2格的高地地形。',
                '健步如飞（需要在游骑兵林场中升级）': '骁勇轻骑兵的移动力增加3格（共15格）、无视所有困难地形，并且不会触发任何地面陷阱。',
                '游击战术（需要在绿荫要塞中升级）': '骁勇轻骑兵处于被骑乘状态时，移动力增加2格、先攻值增加225点。',
            },
            '',
            [InariLightCavalry, InariLightCavalryIcon],
        ),
    InariForestSage:
        createUnit(
            '森林贤者', 2200, 200, 10, 2,
            100, 100, 200, [['近身格斗', 1, 1, '物理']],
            6, 625, 15, 15, 4,
            [0, 325, 175], [0, 3, 0], 12, 6,
            ['翠石高塔'],
            {
                '森林意志': '森林贤者的士气不会低于15。',
                '战吼': '森林贤者消耗100魔法值和一个动作宣言，使距离自身不超过4格的所有伊纳利三足联盟阵营的单位在本回合内获得20点攻击力，不可叠加。',
                '利爪撕裂（需要在自然祭坛中升级）': '森林贤者每次普通攻击命中非器械或建筑目标后，在本回合内为目标附加【重创易伤】状态。' +
                    '处于【重创易伤】状态下的目标防御力下降20点，且一击导致重伤的承受伤害阈值下降至20%最大健康值、单回合重伤的承受伤害阈值下降至40%最大健康值。',
            },
            '',
            [InariForestSage, InariForestSageIcon],
        ),
    InariNatureWizard:
        createUnit(
            '自然巫师', 2000, 200, 8, 2,
            100, 110, 180, [['近身格斗', 1, 1, '物理']],
            6, 630, 10, 10, 4,
            [0, 250, 175], [0, 3, 0], 9, 5,
            ['翠石高塔', '自然祭坛'],
            {
                '痊愈符咒': '自然巫师消耗75魔法值和一个动作宣言，为友军附加一个不可叠加、不可刷新的【痊愈符咒】魔法状态。' +
                    '处于【痊愈符咒】魔法状态下的目标，将在接下来第三个回合结束阶段回复500健康值，并且在回复生效之前，每受到一次伤害，回复效果便会下降20%（加法），最多下降80%。',
                '显形图腾': '自然巫师消耗50魔法值和一个动作宣言，于不超过自身3格的单个空余格子内布置一个持续三回合、可以承受三次伤害的显形图腾。' +
                    '显形图腾持续期间，将会暴露距离自身不超过8格的全部潜行单位。',
                '真视咒文（需要在自然祭坛中升级）': '自然巫师布置的显形图腾侦测暴露潜行的范围增加4格（共12格）。',
                '丰收之环（需要在自然祭坛中升级）': '自然巫师消耗100魔法值和一个动作宣言，使一个资源收集建筑在5回合内，从周围收集资源的速度翻倍（对受影响的采集者同样生效）。',
            },
            '',
            [InariNatureWizard, InariNatureWizardIcon],
        ),
    InariStormPriest:
        createUnit(
            '风暴祭司', 2800, 200, 12, 2,
            120, 120, 160, [['近身格斗', 1, 1, '物理']],
            5, 575, 15, 25, 4,
            [0, 400, 280], [0, 5, 0], 17, 9,
            ['翠石高塔', '风暴神殿'],
            {
                '闪电奔涌': '风暴祭司成功命中的普通攻击会制造闪电链，从受击目标开始，闪电将会传递至距离当前目标距离最近且不超过3格的下一个目标' +
                    '（不包括任何风暴祭司、最初受击目标、被闪电链伤害过的目标）。闪电链的初始伤害为40点气系魔法伤害，依次伤害减半且最多伤害4个目标。',
                '闪电风暴（需要在风暴神殿中升级）': '风暴祭司消耗125魔法值和一个动作宣言，在距离自身不超过12格的任意位置（包括无视野格子）召唤延迟的闪电风暴。' +
                    '闪电风暴将在下个回合的开始阶段出现征兆并将在下下个回合的开始阶段落下，以该施法格子为中心的3×3区域内，对每个格子造成一次500点的气系魔法伤害。闪电风暴对同一单位造成的伤害上限为2500点。',
                '导向性等离子云（需要在风暴神殿中升级）': '风暴祭司的闪电风暴对所有伊纳利三足联盟阵营单位造成的伤害下降90%，并且对器械单位和建筑的伤害增加20%。' +
                    '此外，闪电风暴对同一单位造成的伤害上限提升至3000点。',
            },
            '',
            [InariStormPriest, InariStormPriestIcon],
        ),
}

export default InariUnits