import React from "react"
import { createHero } from '../Functions'

import InariKoko from '../../../../images/monsters/inari/heros/InariKoko.png'
import InariKokoIcon from '../../../../images/monsters/inari/heros/InariKokoIcon.png'
import InariZarak from '../../../../images/monsters/inari/heros/InariZarak.png'
import InariZarakIcon from '../../../../images/monsters/inari/heros/InariZarakIcon.png'
import InariIara from '../../../../images/monsters/inari/heros/InariIara.png'
import InariIaraIcon from '../../../../images/monsters/inari/heros/InariIaraIcon.png'

const InariHeros = {
    InariKoko:
        createHero(
            '可可', '十英雄之一·翠影幽林的猫灵舞姬',
            [950, 1150, 1350, 1600], [0, 0, 0, 0], [20, 26, 33, 40], [0, 0, 0, 0],
            [100, 130, 160, 200], [100, 130, 160, 200], [220, 270, 320, 380],
            [
                ['近身格斗', 1, 1, '物理'],
            ],
            [10, 12, 14, 16], [1310, 1420, 1530, 1640], [35, 40, 45, 55], [15, 19, 25, 35], '1',
            {
                '三步铁拳（被动）': '可可发动攻击宣言时，若本回合刚好移动了3格，则可可的本次攻击宣言伤害上升40/75/150/280点。',
                '猫步三角锁': '可可消耗一个动作宣言，立刻骑乘一个非本部族的体型不大于9格的相邻单位，处于骑乘状态的可可能够消耗攻击宣言攻击该单位，' +
                    '也可以随时可以消耗2点移动力从该单位身上离开。被可可骑乘的单位，总移动力下降1/2/3/4点（最小为1点）、士气值下降点5/11/19/30点，总防御力下降5/9/14/20点，' +
                    '且无法攻击到可可。可可在骑乘时，除被骑乘单位以外的其他单位可以正常攻击到可可。猫步三角锁可以对特殊角色生效。',
                '古灵精怪（被动）': '只要可可不主动攻击，任何中立单位都不会主动攻击可可。若可可给予中立单位最后一击，获得的对应讨伐资源奖励将会增加50%/125%/250%/500%。',
                '祭火之术': '可可将以自己为中心召唤一个3×3的飞行魔法单位火凤凰。可可能够随时消耗一个动作宣言，将火凤凰驱散。火凤凰存在期间，可可无法召唤新的火凤凰，' +
                    '且她在每回合结束阶段流失100点健康值，若本次可可流失健康值会导致可可倒下，则可可的健康值会被扣至1点，同时火凤凰会在下个回合开始阶段被驱散。' +
                    '火凤凰被消灭或驱散后，技能立刻进入冷却，冷却时间30回合。火凤凰造成远程爆炸火系魔法伤害，属于元素单位且拥有3000点健康值、200点攻击力与防御力、' +
                    '300点对空伤害值和160点对地伤害值、1~10格对空射程和1~4格对地射程、12格移动力、2000点先攻值、25点暴击值。',
            },
            '',
            [InariKoko, InariKokoIcon],
        ),
    InariZarak:
        createHero(
            '扎拉克', '联盟战士长·奔腾的火焰',
            [1200, 1600, 2000, 2700], [100, 100, 100, 100], [12, 14, 17, 20], [2, 2, 2, 2],
            [100, 130, 160, 200], [100, 130, 160, 200], [225, 265, 310, 360],
            [
                ['近战武器', 1, 2, '物理'],
            ],
            [12, 13, 14, 15], [1200, 1300, 1400, 1500], [15, 15, 15, 15], [15, 15, 15, 15], '4',
            {
                '待补充1': '待补充',
                '待补充2': '待补充',
                '待补充3': '待补充',
                '待补充4': '待补充',
            },
            '',
            [InariZarak, InariZarakIcon],
        ),
    InariIara:
        createHero(
            '娅菈', '联盟植物学者·恩赐之手',
            [750, 875, 1000, 1300], [200, 200, 200, 200], [10, 10, 10, 10], [4, 4, 5, 6],
            [100, 130, 160, 200], [100, 130, 160, 200], [100, 110, 120, 130],
            [
                ['近身格斗', 1, 1, '物理'],
            ],
            [5, 5, 5, 5], [125, 130, 135, 140], [15, 15, 15, 15], [0, 0, 0, 0], '1（0）',
            {
                '活体酸性蘑菇': '娅菈消耗50点魔法值和一个动作宣言，在相邻的格子内埋下一个【潜行】的活体酸性蘑菇（50健康值，50防御力，1000先攻值）。活体酸性蘑菇可以在自己的轮次内自行引爆，' +
                    '立刻激活距离其不超过8格内的全部毒粉陷阱，并且对不超过其6格内的全部非伊纳利三足联盟阵营的单位刷新4/5/6/6回合【酸性蘑菇毒液】状态，' +
                    '处于【酸性蘑菇毒液】状态下的单位，总移动力减少1/1/2/2格（最小为1格）、先攻值减少60/150/320/700（最小为0），且每回合结束阶段流失20/50/95/200健康值（不能致死）。' +
                    '【酸性蘑菇毒液】状态本身和减益、健康值流失等效果均属于生物附着效果。',
                '蒸馏': '娅菈消耗50/37/24/10点魔法值和一个动作宣言，为相邻的一个浸毒标枪骑兵补充一个毒粉陷阱（最大持有2个）。',
                '精密信息素（被动）': '距离娅菈不超过10/12/15/20格的所有本部族的短弓刺客和猎狮矛手，伺机而动时，可以额外移动0/1/1/2格，并且主动解除【潜行】状态并发动攻击宣言时，' +
                    '额外造成20%/45%/75%/125%伤害。',
                '猫变': '娅菈可以消耗一个动作宣言，取消或进入【猫变】状态。处于【猫变】状态下的她体型降低为0格且立刻进入【潜行】状态，攻击力与防御力降低50点，' +
                    '并且只要不主动攻击或主动解除就不会解除【潜行】状态。娅菈可以消耗一个移动宣言主动解除【潜行】状态。' +
                    '当娅菈处于【猫变】状态下并解除【潜行】状态时，立刻使距离自身不超过4格的本部族伊纳利三足联盟的单位在回合结束前获得15点攻击力。' +
                    '之后，处于【猫变】状态下但不处于【潜行】状态下的她增加70点伤害值、8点移动力。' +
                    '娅菈在猫变状态下无法使用活体酸性蘑菇技能和蒸馏技能，但精密信息素仍然生效。一旦娅菈成功切换形态，该技能立刻进入冷却，冷却时间5回合。',
            },
            '',
            [InariIara, InariIaraIcon],
        ),
}

export default InariHeros