import { createBuilding } from '../Functions'
import FortalezaLizardChamber from '../../../../images/monsters/fortaleza/buildings/FortalezaLizardChamber.png'
import FortalezaDragonHall from '../../../../images/monsters/fortaleza/buildings/FortalezaDragonHall.png'
import FortalezaKingsHall from '../../../../images/monsters/fortaleza/buildings/FortalezaKingsHall.png'
import FortalezaMarteStatue from '../../../../images/monsters/fortaleza/buildings/FortalezaMarteStatue.png'
import FortalezaCrypt from '../../../../images/monsters/fortaleza/buildings/FortalezaCrypt.png'
import FortalezaCrawlingNest from '../../../../images/monsters/fortaleza/buildings/FortalezaCrawlingNest.png'
import FortalezaDragonTemple from '../../../../images/monsters/fortaleza/buildings/FortalezaDragonTemple.png'
import FortalezaFlameLair from '../../../../images/monsters/fortaleza/buildings/FortalezaFlameLair.png'
import FortalezaShadowLair from '../../../../images/monsters/fortaleza/buildings/FortalezaShadowLair.png'
import FortalezaFlyingNest from '../../../../images/monsters/fortaleza/buildings/FortalezaFlyingNest.png'
import FortalezaSpiralLair from '../../../../images/monsters/fortaleza/buildings/FortalezaSpiralLair.png'
import FortalezaLavaFoundry from '../../../../images/monsters/fortaleza/buildings/FortalezaLavaFoundry.png'
import FortalezaStonehenge from '../../../../images/monsters/fortaleza/buildings/FortalezaStonehenge.png'
import FortalezaDragonNest from '../../../../images/monsters/fortaleza/buildings/FortalezaDragonNest.png'
import FortalezaBlackDragonLair from '../../../../images/monsters/fortaleza/buildings/FortalezaBlackDragonLair.png'
import FortalezaFrostDragonLair from '../../../../images/monsters/fortaleza/buildings/FortalezaFrostDragonLair.png'

const FortalezaBuildings = {
    FortalezaLizardChamber:
        createBuilding(
            '蜥穴议事厅', 3000, 0, 0, 0,
            0, 200, 0, [], 16,
            [500, 0, 0], [1, 0, 0, 12], 52,
            [0, 15], [],
            {
                '大本营建筑': '该建筑是昆吉斯塔军团的大本营建筑。',
                '资源收集建筑': '该建筑是资源收集建筑。',
                '生产建筑': '该建筑是蜥龙劳役的生产建筑。',
            },
            {
                '升级成龙纹会堂': [300, 0, 100, 43, ['暗影巢穴'],
                    '将这个蜥穴议事厅升级成龙纹会堂，解锁更多的生产和升级。'
                ],
                '劳动的智慧': [0, 200, 50, 16, [],
                    '蜥龙劳役额外获得100%的总经验。'
                ],
            },
            '',
            [FortalezaLizardChamber, null],
        ),
    FortalezaDragonHall:
        createBuilding(
            '龙纹会堂', 4000, 0, 0, 0,
            100, 200, 50, [['远程冲击', 1, 9, '火系魔法']], 16,
            [800, 0, 100], [8, 0, 1, 80], 95,
            [0, 27], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '大本营建筑': '该建筑是昆吉斯塔军团的大本营建筑。',
                '资源收集建筑': '该建筑是资源收集建筑。',
                '生产建筑': '该建筑是蜥龙劳役的生产建筑。',
                '防御建筑': '该建筑是防御建筑。',
                '远程反击': '该建筑受到远程攻击宣言时，可以尝试提前消耗攻击宣言，并立刻进行一次攻击。',
                '强力追踪火球（需要在熔岩铸造厂中升级）': '龙纹会堂的最大射程增加1格（共10格），并且伤害提升25点（共75点）。',
            },
            {
                '升级成龙王殿': [500, 0, 200, 55, ['螺旋巢穴', '熔岩铸造厂'],
                    '将这个龙纹会堂升级成龙王殿，解锁更多的生产和升级。'
                ],
                '劳动的智慧': [0, 200, 50, 15, [],
                    '蜥龙劳役额外获得100%的总经验。'
                ],
                '献祭文化': [0, 200, 100, 25, [],
                    '除蜥龙劳役以外的本部族单位可以消耗一个动作宣言将本部族的蜥龙劳役作为祭品享用，被享用的蜥龙劳役将会死亡，' +
                    '享用者立刻解除【重伤】状态，并将在三回合内，每个回合的结束阶段回复20%这只蜥龙劳役当前的健康值。',
                ],
                '优胜劣汰': [0, 425, 275, 40, ['献祭文化'],
                    '所有晋升者击败本部族的单位也可以获得该单位造价相关的经验值（木材×1+食纤×1+魔晶×2，1000/每个特殊角色）。在献祭蜥龙劳役时，享用者也被视为击败了蜥龙劳役。',
                ],
            },
            '',
            [FortalezaDragonHall, null],
        ),
    FortalezaKingsHall:
        createBuilding(
            '龙王殿', 5000, 0, 0, 0,
            100, 200, 60, [['远程冲击', 1, 10, '火系魔法']], 16,
            [1300, 0, 300], [5, 0, 1, 40], 150,
            [0, 40], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '大本营建筑': '该建筑是昆吉斯塔军团的大本营建筑。',
                '资源收集建筑': '该建筑是资源收集建筑。',
                '生产建筑': '该建筑是蜥龙劳役的生产建筑。',
                '防御建筑': '该建筑是防御建筑。',
                '双重攻击': '该建筑每回合拥有两次攻击宣言。',
                '远程反击': '该建筑受到远程攻击宣言时，可以尝试提前消耗攻击宣言，并立刻进行一次攻击。',
                '强力追踪火球（需要在熔岩铸造厂中升级）': '龙王殿的最大射程增加2格（共12格），并且伤害提升40点（共100点）。',
            },
            {
                '劳动的智慧': [0, 200, 50, 15, [],
                    '蜥龙劳役额外获得100%的总经验。'
                ],
                '献祭文化': [0, 200, 100, 25, [],
                    '除蜥龙劳役以外的本部族单位可以消耗一个动作宣言将本部族的蜥龙劳役作为祭品享用，被享用的蜥龙劳役将会死亡，' +
                    '享用者立刻解除【重伤】状态，并将在三回合内，每个回合的结束阶段回复20%这只蜥龙劳役当前的健康值。',
                ],
                '优胜劣汰': [0, 425, 275, 40, ['献祭文化'],
                    '所有晋升者击败本部族的单位也可以获得该单位造价相关的经验值（木材×1+食纤×1+魔晶×2，1000/每个特殊角色）。在献祭蜥龙劳役时，享用者也被视为击败了蜥龙劳役。',
                ],
                '团体狩猎': [0, 400, 300, 50, ['优胜劣汰'],
                    '晋升者击败一个单位后，距离该晋升者不超过6格的所有本部族其他晋升者，获得25%的击败经验值。',
                ],
                '晋升优先法则': [0, 500, 350, 50, ['优胜劣汰'],
                    '所有晋升者每回合获得10点经验值。',
                ],
                '王的赏赐': [0, 1000, 325, 65, ['优胜劣汰'],
                    '每次晋升者成功晋升后，立刻回复全部的健康值和魔法值，并在当前回合增加100点士气。',
                ],
            },
            '',
            [FortalezaKingsHall, null],
        ),
    FortalezaMarteStatue:
        createBuilding(
            '战神雕像', 1600, 0, 0, 0,
            0, 200, 0, [], 4,
            [150, 0, 0], [1, 0, 0, 20], 20,
            [0, 0], ['蜥穴议事厅/龙纹会堂/龙王殿'],
            {
                '英雄祭坛': '当战神雕像存在时，允许从三名昆吉斯塔军团阵营特殊角色中选择召唤一位，领导军队和协助战斗。一个部族只能从所有祭坛中召唤仅一名特殊角色。',
            },
            {
                '龙巢英雄降临': [0, 0, 0, 20, ['当前部族没有召唤任何特殊角色'],
                    '立刻在任意一个战神雕像周围召唤一名昆吉斯塔军团阵营的特殊角色。'
                ],
                '龙巢初级天眷': [0, 200, 100, 25, ['龙巢英雄降临', '龙纹会堂/龙王殿'],
                    '昆吉斯塔军团的特殊角色将会解锁第二个技能，并且获得一次强化技能和角色基础属性的权力。技能的解锁和强化不需要任何宣言。'
                ],
                '龙巢中级天眷': [0, 400, 200, 30, ['龙巢初级天眷', '龙王殿'],
                    '昆吉斯塔军团的特殊角色将会解锁第三个技能，并且获得一次强化技能和角色基础属性的权力。技能的解锁和强化不需要任何宣言。'
                ],
                '龙巢终级天眷': [0, 800, 400, 40, ['龙巢中级天眷'],
                    '昆吉斯塔军团的特殊角色将会解锁终极技能，并且获得一次强化非终极技能和角色基础属性的权力。技能的解锁和强化不需要任何宣言。'
                ],
                '救赎天眷': [0, '200+已强化次数×100', '100+已强化次数×50', '14回合+已强化次数×2', ['特殊角色已经倒下'],
                    '使已经倒下的角色健康值、魔法值重置到50%最大值，并在任意一个战神雕像周围召唤此角色。' +
                    '角色的技能组、强化、经验值全部得到保留，但持有物品会被清空。救赎天眷若满足需求则可以重复升级。',
                ],
            },
            '',
            [FortalezaMarteStatue, null],
        ),
    FortalezaCrypt:
        createBuilding(
            '地穴', 1200, 0, 0, 0,
            0, 200, 0, [], 9,
            [250, 0, 0], [1, 0, 0, 10], 15,
            [0, 20], ['蜥穴议事厅/龙纹会堂/龙王殿'],
            {
                '祭品': '当地穴内不存在祭品时，地穴在回合结束阶段会积累1层【祭品】，当地穴积累10层【祭品】后，下个回合的开始阶段会消耗掉10层【祭品】，' +
                    '在其中召唤蜥蜴祭品（100健康值，50防御力，可以被攻击），任何昆吉斯塔军团的晋升者都可以在相邻地穴的格子吃掉祭品，并获得25点经验值。吃掉祭品不需要任何宣言。',
                '贪婪（需要升级）': '地穴提供的贡品被吃掉时，晋升者获得额外15点经验值（共40点）。',
                '附魔地基（需要在熔岩铸造厂中升级）': '地穴的建造时间减少5回合（共10回合）。',
            },
            {
                '贪婪': [0, 150, 25, 10, ['龙纹会堂/龙王殿'],
                    '地穴提供的贡品被吃掉时，晋升者获得额外15点经验值（共40点）。'
                ],
                '修建成爬行龙巢': [0, 0, 0, 12, ['蜥穴议事厅/龙纹会堂/龙王殿'],
                    '将这个地穴修建成爬行龙巢，以生产爬行龙类。'
                ],
                '修建成龙之圣殿': [0, 0, 100, 15, ['爬行龙巢'],
                    '将这个地穴修建成龙之圣殿，以解锁军队的升级。'
                ],
                '修建成烈焰巢穴': [-100, 0, 50, 12, ['爬行龙巢'],
                    '将这个地穴修建成烈焰巢穴，以解锁毁灭龙的生产。'
                ],
                '修建成暗影巢穴': [-50, 0, 100, 17, ['烈焰巢穴'],
                    '将这个地穴修建成烈焰巢穴，以解锁影爪龙的生产。'
                ],
                '修建成飞行龙巢': [0, 0, 75, 20, ['龙纹会堂/龙王殿'],
                    '将这个地穴修建成飞行龙巢，以生产飞行龙类。'
                ],
                '修建成螺旋巢穴': [-50, 0, 150, 17, ['飞行龙巢'],
                    '将这个地穴修建成螺旋巢穴，以解锁长尾翼龙的生产。'
                ],
                '修建成熔岩铸造厂': [-100, 0, 150, 17, ['龙纹会堂/龙王殿'],
                    '将这个地穴修建成熔岩铸造厂，以解锁建筑的升级。'
                ],
                '修建成巨石炮塔': [25, 0, 75, 10, ['熔岩铸造厂'],
                    '将这个地穴修建成防御建筑巨石炮塔。'
                ],
                '修建成巨龙巢': [0, 50, 200, 30, ['龙王殿', '周围一圈格子内没有任何障碍'],
                    '将这个地穴修建成巨龙巢，以生产巨型龙类。'
                ],
                '修建成黑龙巢穴': [0, 100, 350, 40, ['巨龙巢', '周围一圈格子内没有任何障碍'],
                    '将这个地穴修建成黑龙巢穴，以解锁黑龙的生产。'
                ],
                '修建成霜龙巢穴': [0, 100, 350, 42, ['巨龙巢', '周围一圈格子内没有任何障碍'],
                    '将这个地穴修建成霜龙巢穴，以解锁霜龙的生产。'
                ],
            },
            '',
            [FortalezaCrypt, null],
        ),
    FortalezaCrawlingNest:
        createBuilding(
            '爬行龙巢', 2000, 0, 0, 0,
            0, 200, 0, [], 9,
            [250, 0, 0], [1, 0, 0, 16], 27,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '生产建筑': '该建筑是迅猛龙的生产建筑。',
                '高级生产建筑（需要拥有烈焰巢穴建筑）': '该建筑是毁灭龙的生产建筑。',
                '高级生产建筑（需要拥有暗影巢穴建筑）': '该建筑是影爪龙的生产建筑。',
            },
            {},
            '',
            [FortalezaCrawlingNest, null],
        ),
    FortalezaDragonTemple:
        createBuilding(
            '龙之圣殿', 2000, 0, 0, 0,
            0, 250, 100, [], 9,
            [200, 0, 0], [5, 0, 1, 80], 30,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
            },
            {
                '初级战斗荣耀': [200, 200, 200, 20, [],
                    '晋升者击倒单位获得的总经验值增加10%。'
                ],
                '中级战斗荣耀': [225, 225, 250, 23, ['初级战斗荣耀', '龙纹会堂/龙王殿'],
                    '晋升者击倒单位获得的总经验值增加10%（共增加20%）。'
                ],
                '高级战斗荣耀': [250, 250, 300, 25, ['中级战斗荣耀', '龙王殿'],
                    '晋升者击倒单位获得的总经验值增加10%（共增加30%）。'
                ],
                '初级龙之力量': [100, 200, 250, 25, [],
                    '迅猛龙、毁灭龙、铁锤翼龙、龟甲巨龙的攻击力与防御力增加10点。'
                ],
                '中级龙之力量': [125, 250, 300, 30, ['初级龙之力量', '龙纹会堂/龙王殿'],
                    '迅猛龙、毁灭龙、铁锤翼龙、龟甲巨龙的攻击力与防御力增加10点（共增加20点）。'
                ],
                '高级龙之力量': [150, 300, 350, 35, ['中级龙之力量', '龙王殿'],
                    '迅猛龙、毁灭龙、铁锤翼龙、龟甲巨龙的攻击力与防御力增加10点（共增加30点）。'
                ],
                '初级至高血统': [150, 300, 250, 35, [],
                    '黑龙、霜龙的攻击力、防御力、魔法上限增加16点。'
                ],
                '中级至高血统': [150, 375, 325, 35, ['初级至高血统', '龙纹会堂/龙王殿'],
                    '黑龙、霜龙的攻击力、防御力、魔法上限增加17点（共增加33点）。'
                ],
                '高级至高血统': [150, 450, 400, 35, ['中级至高血统', '龙王殿'],
                    '黑龙、霜龙的攻击力、防御力、魔法上限增加17点（共增加50点）。'
                ],
                '军团意志': [75, 150, 50, 15, ['龙纹会堂/龙王殿'],
                    '迅猛龙、毁灭龙、影爪龙的训练时间分别减少3、4、5回合。'
                ],
                '暴力传统': [125, 300, 225, 25, ['龙王殿'],
                    '迅猛龙、毁灭龙、影爪龙额外获得50%的总经验。'
                ],
            },
            '',
            [FortalezaDragonTemple, null],
        ),
    FortalezaFlameLair:
        createBuilding(
            '烈焰巢穴', 1800, 0, 0, 0,
            0, 200, 0, [], 9,
            [150, 0, 50], [1, 0, 0, 15], 27,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '毁灭龙': '该建筑的存在允许爬行龙巢训练毁灭龙。',
            },
            {
                '茹火饮焰': [0, 200, 125, 15, ['龙纹会堂/龙王殿'],
                    '训练毁灭龙的费用永久降低25食纤和25魔晶（共325食纤和100魔晶）。'
                ],
                '火花绽放': [0, 375, 250, 25, ['龙王殿'],
                    '毁灭龙对非水系或不拥有水附魔的非建筑单位造成火系伤害后，目标会刷新2回合的【毁灭火花】状态。' +
                    '处于【毁灭火花】状态下的目标，每回合结束阶段再次受到来源于这个毁灭龙的30点火系魔法伤害。' +
                    '若目标在3个回合内持续受到3次毁灭火花的伤害（包括被溅射），则立刻移除该目标的【毁灭火花】状态，并以该目标为核心，' +
                    '对3×3范围内的全部单位造成一次来源于这个毁灭龙的60点火系魔法伤害。',
                ],
            },
            '',
            [FortalezaFlameLair, null],
        ),
    FortalezaShadowLair:
        createBuilding(
            '暗影巢穴', 1600, 0, 0, 0,
            0, 200, 0, [], 9,
            [200, 0, 100], [2, 0, 1, 32], 32,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '毁灭龙': '该建筑的存在允许爬行龙巢训练毁灭龙。',
            },
            {
                '幻影穿梭': [0, 150, 150, 20, ['龙纹会堂/龙王殿'],
                    '影爪龙增加2点移动力，并且在移动中无视单位碰撞体积。'
                ],
                '黑暗魔力相性': [0, 200, 350, 25, ['龙王殿'],
                    '影爪龙在夜晚的每个回合额外回复4点魔法值。'
                ],
            },
            '',
            [FortalezaShadowLair, null],
        ),
    FortalezaFlyingNest:
        createBuilding(
            '飞行龙巢', 1500, 0, 0, 0,
            0, 200, 0, [], 9,
            [250, 0, 75], [3, 0, 1, 40], 35,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '生产建筑': '该建筑是铁锤翼龙的生产建筑。',
                '高级生产建筑（需要拥有螺旋巢穴建筑）': '该建筑是长尾翼龙的生产建筑。',
            },
            {},
            '',
            [FortalezaFlyingNest, null],
        ),
    FortalezaSpiralLair:
        createBuilding(
            '螺旋巢穴', 1750, 0, 0, 0,
            0, 200, 0, [], 9,
            [200, 0, 150], [4, 0, 3, 70], 32,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '长尾翼龙': '该建筑的存在允许飞行龙巢训练长尾翼龙。',
            },
            {
                '铁锤俯冲': [0, 300, 75, 15, [],
                    '铁锤翼龙消耗一个动作宣言，对一个水平距离自己不超过3格的地面格子进行俯冲，并对其中的单位造成80%物理伤害。' +
                    '若命中【潜行】状态下的单位，则会立刻解除该单位的【潜行】状态。',
                ],
                '回路共振': [0, 150, 50, 15, [],
                    '长尾翼龙的治疗波和魔力聚集可以对自身施放。',
                ],
                '惯性甩尾': [0, 125, 275, 30, ['龙王殿'],
                    '长尾翼龙的地面拖拽范围增加2格，空中拖拽范围增加3格。',
                ],
            },
            '',
            [FortalezaSpiralLair, null],
        ),
    FortalezaLavaFoundry:
        createBuilding(
            '熔岩铸造厂', 3000, 0, 0, 0,
            0, 200, 0, [], 9,
            [150, 0, 150], [1, 0, 1, 40], 32,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
            },
            {
                '附魔地基': [200, 0, 200, 25, [],
                    '地穴的建造时间减少5回合（共10回合）。',
                ],
                '重炮轰击': [300, 0, 175, 25, [],
                    '巨石炮塔的缓慢攻击，变为每四回合只能发动一次攻击宣言，但造成的伤害增加100%。',
                ],
                '墨银核心驱动': [150, 0, 75, 20, ['龙王殿'],
                    '巨石炮塔无视任何形式的建筑瘫痪类效果。',
                ],
                '强力追踪火球': [300, 0, 100, 20, [],
                    '龙纹会堂、龙王殿的最大射程分别增加1格、2格（共10格、12格），并且伤害分别提升25点、40点（共75点、100点）。',
                ],
            },
            '',
            [FortalezaLavaFoundry, null],
        ),
    FortalezaStonehenge:
        createBuilding(
            '巨石炮塔', 1500, 0, 0, 0,
            120, 200, 300, [['远程冲击（对地）', 3, 9, '物理和土系魔法'], ['远程冲击（对空）', 3, 6, '120%物理和土系魔法']], 9,
            [275, 0, 75], [3, 0, 1, 40], 25,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '防御建筑': '该建筑是防御建筑。',
                '缓慢攻击': '巨石炮塔每两回合只能发动一次攻击宣言。',
                '重炮轰击（需要在熔岩铸造厂中升级）': '巨石炮塔的缓慢攻击，变为每四回合只能发动一次攻击宣言，但造成的伤害增加100%。',
                '墨银核心驱动（需要在熔岩铸造厂中升级）': '巨石炮塔无视任何形式的建筑瘫痪类效果。',
            },
            {},
            '',
            [FortalezaStonehenge, null],
        ),
    FortalezaDragonNest:
        createBuilding(
            '巨龙巢', 3000, 0, 0, 0,
            0, 200, 0, [], 25,
            [250, 50, 200], [5, 1, 4, 120], 45,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '生产建筑': '该建筑是龟甲巨龙的生产建筑。',
                '高级生产建筑（需要拥有黑龙巢穴建筑）': '该建筑是黑龙的生产建筑。',
                '高级生产建筑（需要拥有霜龙巢穴建筑）': '该建筑是霜龙的生产建筑。',
            },
            {
                '尖刺外壳': [0, 400, 200, 30, [],
                    '龟甲巨龙受到的远程伤害降低20%；龟甲巨龙受到近战伤害时，将会反弹20%同类型的伤害给伤害来源。'
                ],
            },
            '',
            [FortalezaDragonNest, null],
        ),
    FortalezaBlackDragonLair:
        createBuilding(
            '黑龙巢穴', 2500, 0, 0, 0,
            0, 200, 0, [], 25,
            [250, 100, 350], [5, 2, 7, 100], 55,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '黑龙': '该建筑的存在允许巨龙巢训练黑龙。',
            },
            {
                '暴食': [0, 350, 275, 30, [],
                    '黑龙可以彻底吞噬一个自己部族的生物单位，' +
                    '获得该单位造价相关的经验值（木材×0.5+食纤×0.5+魔晶×1，可以与献祭文化科技叠加）并回复该单位剩余的魔法值。',
                ],
                '御空吐息': [0, 250, 250, 25, [],
                    '黑龙可以在飞行状态下施放毁灭龙息。',
                ],
                '魔法免疫': [0, 400, 400, 50, [],
                    '黑龙永远不会成为魔法法术的目标，并且受到的魔法伤害下降50%。',
                ],
            },
            '',
            [FortalezaBlackDragonLair, null],
        ),
    FortalezaFrostDragonLair:
        createBuilding(
            '霜龙巢穴', 2250, 0, 0, 0,
            0, 200, 0, [], 25,
            [250, 100, 350], [5, 2, 7, 90], 57,
            [0, 0], [],
            {
                '升级而来的建筑': '该建筑无法直接被建造，而是应该通过其他建筑升级得到。',
                '霜龙': '该建筑的存在允许巨龙巢训练霜龙。',
            },
            {
                '魔力汲取': [0, 75, 325, 30, [],
                    '霜龙消耗一个动作宣言，偷取距离自身不超过8格的任意单位上的25点魔法值。'
                ],
                '魔力回流': [0, 125, 275, 40, [],
                    '霜龙的所有魔法消耗降低25点。'
                ],
                '急冻气流': [0, 175, 100, 35, [],
                    '霜龙对建筑造成伤害后，将会刷新其2回合【冰冻】状态。处于冰冻状态下的建筑，无法推进生产和升级。'
                ],
            },
            '',
            [FortalezaFrostDragonLair, null],
        ),
}

export default FortalezaBuildings